kb1c/src/InformationRegisters/СвязьКомментариевБазыЗнаний/СвязьКомментариевБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьКомментариевБазыЗнаний</name>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.КомментарииБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.КомментарииБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/InformationRegisters/СвязьКомментариевБазыЗнаний/ManagerModule.bsl
Процедура УстановитьСвязь(знач РодительСсылка, знач ПодчиненныйСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РодительСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СвязьКомментариевБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьСвязь(знач РодительСсылка, знач ПодчиненныйСсылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СвязьКомментариевБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры
